12/data/attachments/f2605fc0adb38a63.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Steven_unit_Friend_64760_3</nif:username>
            <nif:friendToBeRequested>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>